* xg480_phy 25g/10g verification todo [25%]
** TODO The rate_meter_multiple issues [%]
*** TODO Line side rate_meter_rx trigger mac_tx send out the pause; the interval isn't correct.
    - State "TODO"       from "WAITING"    [2018-05-30 Wed 11:25]
rate_meter_multiple has bug, the interval of ON type pause is so closed. it's 200us, the expect value is 2ms.
*** TODO Line side mac_tx port shaper function test based on rate_meter_multiple
    - State "TODO"       from "WAITING"    [2018-05-30 Wed 11:25]
mac_tx has not implement it
** STARTED vlan_det_lookup device level test. [75%]
   :LOGBOOK:  
   CLOCK: [2018-05-30 Wed 12:20]--[2018-05-30 Wed 12:21] =>  0:01
   CLOCK: [2018-05-30 Wed 12:13]--[2018-05-30 Wed 12:14] =>  0:01
   CLOCK: [2018-05-30 Wed 11:51]--[2018-05-30 Wed 11:59] =>  0:08
   CLOCK: [2018-05-30 Wed 11:32]--[2018-05-30 Wed 11:49] =>  0:17
   :END:      
*** DONE tb_env support
    CLOSED: [2018-05-30 Wed 16:13]
    - State "DONE"       from "TODO"       [2018-05-30 Wed 16:13]
*** DONE transfer function support: lpbk_y1564_det transfer funciton instance the vlan_det_lookup TF.
    CLOSED: [2018-05-30 Wed 16:13]
    - State "DONE"       from "TODO"       [2018-05-30 Wed 16:13]
*** TODO testcase setup [0%]
**** STARTED tc_302 [100%]
     :LOGBOOK:  
     CLOCK: [2018-05-31 Thu 09:45]--[2018-05-31 Thu 09:46] =>  0:01
     CLOCK: [2018-05-30 Wed 17:32]--[2018-05-30 Wed 17:38] =>  0:06
     CLOCK: [2018-05-30 Wed 17:08]--[2018-05-30 Wed 17:16] =>  0:08
     CLOCK: [2018-05-30 Wed 16:23]--[2018-05-30 Wed 16:27] =>  0:04
     :END:      
     - [X] flow based fac loopback by vlan_det_lookup; disable port based loop, provisioning only 1 matchId(63)
       change the mac_rx_4.sv to every segment send request to vlan_det module; there are 2 flows did not loopback, need Jimmy to double check DUT.<2018-05-30 Wed 17:42> 
       the vlan_det_lookup moudle has bug. Bob is working on it. <2018-05-31 Thu 09:45> 
*** DONE align the testcase from 25g device to 10g device [100%]
    CLOSED: [2018-05-30 Wed 17:06]
    - State "DONE"       from "STARTED"    [2018-05-30 Wed 17:06]
    :LOGBOOK:  
    CLOCK: [2018-05-30 Wed 16:47]--[2018-05-30 Wed 17:03] =>  0:16
    :END:      
    - [X] tc_302
** TODO port_process_ingress/port_process_egress (afp+pcp) test. [0%]
the spec has been ready, RTL has not been ready.
*** TODO provisioning method
*** TODO transfer function
*** TODO testcase [0/2]
    - [ ] ingress
    - [ ] egress
** TODO 100g PTP [0%]
*** TODO read 100g PTP related module spec
*** TODO transfer function and tb_env
*** TODO testcase setup 
** TODO 100g CGMII interface [%]
*** TODO CGMII Monitor [50%]
    - [X] CGMII RX SPEC and RTL [2/2]
      - [X] SPEC: the SPEC has been ready, Leo committed it.<2018-05-30 Wed> 
      - [X] RTL: it has been ready <2018-05-30 Wed> 
    - [ ] UVM monitor 
*** TODO CGMII Driver [%]
    - [ ] CGMII TX [0/3]
      - [ ] SPEC
      - [ ] RTL
    - [ ] UVM Driver 
** TODO y1564 feature test.
*** TODO monitor, Lance work on it.
*** TODO generator, Lance work on it.
** TODO Reserved Pin on DUT's top test [%]
*** TODO update tc_1000 [0/5]
**** TODO sgmii east/west backpressure out/in pin.
sgmiiEastRxBackpressureOut,
sgmiiEastTxBackpressureIn,
sgmiiWestRxBackpressureOut,
sgmiiWestTxBackpressureIn
In top.sv connect the output to input, then write the internal register with 1/0, read the input indication register.
**** TODO gasicParityInOut, gasicParityErrOut
input         gasicParityInOut  ,
input  logic  gasicParityErrOut , // change to input for pin test
Set those two signal 1/0, read the related indication register on device reg.
**** TODO SFP reserve pin
   input    logic [7:0]          sfpPresentIn_n             ,
   input    logic [7:0]          sfpLosIn                   ,
   input    logic [7:0]          sfpTxFaultIn               ,
   output   logic [7:0]          sfpTxDisableOut            ,
   output   logic [7:0]          sfpModuleSelOut            ,
   output   logic [7:0]          sfpLowPowerModeOut         ,
For input signal, set them to 1/0, read related indication register on device reg.
For output signal, write the related regiset on device reg, check/monitor the signal on top.sv/TB.
**** TODO cpldInOut
   input          [3:0]          cpldInOut                  ,     // Only cpldInOut[1:0] valid in HW connection
Input signal, set them to 1/0, read related indication register on device reg.
*** TODO update tc_500c [%]
**** TODO ptpClkCompensate In/out
    input    logic                ptpClkCompensateIn         ,
    output   logic                ptpClkCompensateOut        ,
In top.sv, connect the output to input, read the address 0x0c bit8 on ptp_server module. the value is 1, then change to 0.
**** TODO ptpMicroSemiLoadSave
   input    logic [1:0]          ptpMicroSemiLoadSaveInP    ,
   input    logic [1:0]          ptpMicroSemiLoadSaveInN    ,

   input    logic                clockSynce25In             ,
Read the register on ptp_server module.
*** TODO irqOut
   output   logic                irqOut_n                   ,
has not test, How to test?/!
*** TODO rxClkSelOut
   output   logic [5:0]          rxClkSelOut                ,
10G mode, 156.25Mhz
25G mode, 390.625Mhz
100G mode, 322.625Mhz
1G mode, 125Mhz
Config clock sel, enable and divider factor by register, then check/monitor the output clock's frequency.
*** TODO dyingGaspIn
   input    logic                dyingGaspIn                ,
add it to dyinggasp generation testcase. keep internal register trigger as 0, change it value form 0 to 1 (on top.sv) 5 times, the expected result is 5 times dying gasp frame generated.
** TODO update tc_500b for egress, add TC RT. [0%]
*** STARTED debug TB to support it
    :LOGBOOK:  
    CLOCK: [2018-05-30 Wed 16:39]--[2018-05-30 Wed 16:46] =>  0:07
    :END:      
** DONE PTP full bandwidth. [100%]
   CLOSED: [2018-05-30 Wed 19:24]
   - State "DONE"       from "STARTED"    [2018-05-30 Wed 19:24]
   :LOGBOOK:  
   CLOCK: [2018-05-30 Wed 14:49]--[2018-05-30 Wed 15:08] =>  0:19
   :END:      
*** DONE tc_503 All port input PTP packet with full bandwidth.[100%] 
    CLOSED: [2018-05-30 Wed 19:00]
    - State "DONE"       from "STARTED"    [2018-05-30 Wed 19:00]
    :LOGBOOK:  
    CLOCK: [2018-05-30 Wed 18:32]--[2018-05-30 Wed 18:59] =>  0:27
    CLOCK: [2018-05-30 Wed 18:01]--[2018-05-30 Wed 18:06] =>  0:05
    CLOCK: [2018-05-30 Wed 17:23]--[2018-05-30 Wed 17:31] =>  0:08
    :END:      
    - [X] all inress port input full bandwith traffic with PTP packet.<2018-05-30 Wed 18:59> 
**** DONE TF side need double check.<2018-05-30 Wed 19:26> 
     CLOSED: [2018-05-31 Thu 09:43]
     - State "DONE"       from "STARTED"    [2018-05-31 Thu 09:43]
     :LOGBOOK:  
     CLOCK: [2018-05-31 Thu 09:38]--[2018-05-31 Thu 09:43] =>  0:05
     CLOCK: [2018-05-31 Thu 08:32]--[2018-05-31 Thu 09:21] =>  0:49
     :END:      
    - [X] all egress port input full bandwith traffic with PTP packet, disable overwrite SA on mac_tx.
     when set every flow input 400 packets, there are miscmp errors; Need Tonny to double check it. <2018-05-30 Wed 17:30>
      In the ptp_process spec, about setting updateCorrectField condition is not clear, after disscution with tonny, TF need do modificaiton, if packet is event ptp, and allowopertion, set the updateCorrectField; don't care the egrRxIfPortNum any more. later, tonny wiil update the spec also. 
*** DONE tc_504 All port input PTP and non-PTP packet with full bandwidth.[100%]
    CLOSED: [2018-05-30 Wed 19:07]
    - State "DONE"       from "STARTED"    [2018-05-30 Wed 19:07]
    :LOGBOOK:  
    CLOCK: [2018-05-30 Wed 19:00]--[2018-05-30 Wed 19:07] =>  0:07
    CLOCK: [2018-05-30 Wed 16:21]--[2018-05-30 Wed 16:22] =>  0:01
    CLOCK: [2018-05-30 Wed 15:58]--[2018-05-30 Wed 16:10] =>  0:12
    CLOCK: [2018-05-30 Wed 15:54]--[2018-05-30 Wed 15:55] =>  0:01
    :END:      
    - [X] all egress port input full bandwidth traffic, PTP and non-PTP, disable overwrite SA on mac_tx.
    - [X] all ingress port input full bandwidth traffic, PTP and non-PTP.<2018-05-30 Wed 19:07> 
*** DONE align the related testcase form 25g device to 10g device [100%]
    CLOSED: [2018-05-30 Wed 19:24]
    - State "DONE"       from "STARTED"    [2018-05-30 Wed 19:24]
    - State "TODO"       from "DONE"       [2018-05-30 Wed 19:09]
    - State "DONE"       from "STARTED"    [2018-05-30 Wed 17:18]
    :LOGBOOK:  
    CLOCK: [2018-05-30 Wed 19:10]--[2018-05-30 Wed 19:21] =>  0:11
    CLOCK: [2018-05-30 Wed 15:41]--[2018-05-30 Wed 15:42] =>  0:01
    CLOCK: [2018-05-30 Wed 15:31]--[2018-05-30 Wed 15:37] =>  0:06
    CLOCK: [2018-05-30 Wed 15:12]--[2018-05-30 Wed 15:18] =>  0:06
    :END:      
    - [X] tc_503 
    - [X] tc_504
** TODO full flows loopback test.[0%]
   - [ ] 64 flows do fac loop, term loop, y1564 co-exist on the same port
   - [ ] 64 flows on different ports.
** DONE more details RMON test for mac_rx/tx [100%]
*** DONE all kinds of type RMON test for mac rx/tx [100%]
     CLOSED: [2018-05-30 Wed 09:32]
     - State "DONE"       from "TODO"       [2018-05-30 Wed 09:32]
   - [X] tc_207, re-prduce lab test bug. without transceiver, 64B packet with GOOD/BAD/GOOD/BAD FCS; 
  port0 input 64B packet, port1 input 200B packet; 
  port2 port3 input packet with some phy error (PCS error); 
  port4 input 128B packet with all FCS error. 
  port5 input 129B packet with all FCS error.
   - [X] tc_208, cover all kinds of type RMON for mac_rx/tx 
   - [X] tc_208a, to test RMON with MTU less 1518
*** DONE Normal traffic full bandwidth with RX input some fcs errors. [100%]
    CLOSED: [2018-05-23 Wed 15:27]
   - State "DONE"       from "STARTED"    [2018-05-23 Wed 15:27]
   - [X] with transceiver core. input packet size is 1500
   - [X] bypass transceiver core. input packet size is 1500
*** DONE Align the all related testcase between xg480_phy_25g and xg480_phy_10g device [100%]
    CLOSED: [2018-05-30 Wed 14:48]
    - State "DONE"       from "STARTED"    [2018-05-30 Wed 14:48]
    :LOGBOOK:  
    CLOCK: [2018-05-30 Wed 14:41]--[2018-05-30 Wed 14:43] =>  0:02
    CLOCK: [2018-05-30 Wed 14:29]--[2018-05-30 Wed 14:37] =>  0:08
    CLOCK: [2018-05-30 Wed 14:04]--[2018-05-30 Wed 14:10] =>  0:06
    CLOCK: [2018-05-30 Wed 11:59]--[2018-05-30 Wed 12:13] =>  0:14
    CLOCK: [2018-05-30 Wed 11:49]--[2018-05-30 Wed 11:50] =>  0:01
    :END:      
    - [X] tc_208
    - [X] tc_208a
** DONE Support Haidong lab test [100%]
   CLOSED: [2018-05-31 Thu 10:58]
   - State "DONE"       from "TODO"       [2018-05-31 Thu 10:58]
*** DONE generation the dyinggasp injection testcase all provisionging
    CLOSED: [2018-05-31 Thu 10:58]
    - State "DONE"       from "STARTED"    [2018-05-31 Thu 10:58]
    :LOGBOOK:  
    CLOCK: [2018-05-31 Thu 10:31]--[2018-05-31 Thu 10:39] =>  0:08
    CLOCK: [2018-05-31 Thu 09:48]--[2018-05-31 Thu 10:00] =>  0:12
    :END:      
    based on tc_201b, grep all procWrite.
